content/posts/conformal_field_theory.md
+++
title = "conformal field theory"
author = ["Cameron Smith"]
lastmod = 2020-09-24T22:46:50-04:00
slug = "conformal_field_theory"
draft = false
+++

## CFTs are [renormalization]({{< relref "renormalization" >}}) group fixed points of QFTs {#cfts-are-renormalization--renormalization-dot-md--group-fixed-points-of-qfts}


### Studying the space of CFTs basically amounts to studying the space of all well-defined QFTs  [[<https://physics.stackexchange.com/a/185493/9269>][]] {#studying-the-space-of-cfts-basically-amounts-to-studying-the-space-of-all-well-defined-qfts-https-physics-dot-stackexchange-dot-com-a-185493-9269}


## [Introduction to conformal field theory by Tobias Osborne in 2018](https://www.youtube.com/playlist?list=PLDfPUNusx1Ep5g1jIKXqpNX%5Ft%5FZz-kAlQ) {#introduction-to-conformal-field-theory-by-tobias-osborne-in-2018}


## [ADE or A-D-E classification of conformal field theories](http://www.scholarpedia.org/article/A-D-E%5FClassification%5Fof%5FConformal%5FField%5FTheories) also available on the [arXiv](https://arxiv.org/abs/0911.3242) {#ade-or-a-d-e-classification-of-conformal-field-theories-also-available-on-the-arxiv}


## Conformal  field  theories  lead  to  highest  weight  representations  of  the  [Virasoro  algebra]({{< relref "Virasoro__algebra" >}}),  a  special  case  of  this  being  the  assertion  that  the highest weight  representations  of  affine  Lie  algebras  can  be  extended  to  the  semi-direct  product  with  the Virasoro  algebra. -\* p. 46 [Physics and geometry by Edward Witten in 1986]({{< relref "Physics_and_geometry_by_Edward_Witten_in_1986" >}}) {#conformal-field-theories-lead-to-highest-weight-representations-of-the-virasoro-algebra--virasoro-algebra-dot-md--a-special-case-of-this-being-the-assertion-that-the-highest-weight-representations-of-affine-lie-algebras-can-be-extended-to-the-semi-direct-product-with-the-virasoro-algebra-dot-p-dot-46-physics-and-geometry-by-edward-witten-in-1986--physics-and-geometry-by-edward-witten-in-1986-dot-md}


## [references]({{< relref "references" >}}) {#references--references-dot-md}


### [A mathematical introduction to conformal field theory by Martin Schottenloher in 2008]({{< relref "A_mathematical_introduction_to_conformal_field_theory_by_Martin_Schottenloher_in_2008" >}}) {#a-mathematical-introduction-to-conformal-field-theory-by-martin-schottenloher-in-2008--a-mathematical-introduction-to-conformal-field-theory-by-martin-schottenloher-in-2008-dot-md}
